<?php

return [

    'label' => 'Внеси :label',

    'modal' => [

        'heading' => 'Внеси :label',

        'form' => [

            'file' => [
                'label' => 'Датотека',
                'placeholder' => 'Прикачи CSV датотека',
            ],

            'columns' => [
                'label' => 'Колони',
                'placeholder' => 'Избери колона',
            ],

        ],

        'actions' => [

            'download_example' => [
                'label' => 'Преземи пример на CSV датотека',
            ],

            'import' => [
                'label' => 'Внеси',
            ],

        ],

    ],

    'notifications' => [

        'completed' => [

            'title' => 'Внесот завршен',

            'actions' => [

                'download_failed_rows_csv' => [
                    'label' => 'Преземи информации за неуспешните редови|Преземи информации за неуспешните редови',
                ],

            ],

        ],

        'max_rows' => [
            'title' => 'Прикачената CSV датотека е преголема',
            'body' => 'Не можете да внесете повеќе од 1 ред истовремено.|Не можете да внесете повеќе од :count реда истовремено.',
        ],

        'started' => [
            'title' => 'Внесот започнат',
            'body' => 'Вашиот внес започна и 1 ред ќе биде обработен во позадина.|Вашиот внес започна и :count реда ќе бидат обработени во позадина.',
        ],

    ],

    'example_csv' => [
        'file_name' => ':importer-пример',
    ],

    'failure_csv' => [
        'file_name' => 'внес-:import_id-:csv_name-неуспешни-редови',
        'error_header' => 'грешка',
        'system_error' => 'Системска грешка, ве молиме контактирајте со поддршка.',
    ],

];
